src/CF/Reports/ИнформацияРуководителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>ИнформацияРуководителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВсегоПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыданоСотрудникам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадолженностьСотрудникам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозицийНоменклатурыВОстатках</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КупленоКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КупленоНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйОстатокДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоСотрудникам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборотДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяВаловаяПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиТоваровКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиТовараНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоСкладу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРасчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяПереоценка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяПокупка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяПродажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилоДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилоКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилоТовараНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроданоКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроданоНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаноКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаноНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднееКоличествоРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредняяСуммаРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДолгКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДолгПередПоставщиками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийОстатокДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПредприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченныйДолгПередПоставщиками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченныйДолгКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоНаправлениюДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/CF/Reports/ИнформацияРуководителю/Forms/ФормаОтчета/Ext/Form/Module.bsl
// sza150215-1322
// sza140717-2318
// sza140420-1714
// sza130831-0257

&НаКлиенте
Процедура ВесьПериод(Команда)

	отчет.ДатаНачала    = ОбщийМодульСервисСервер.ДатаПервогоДокумента();
	отчет.ДатаОкончания = конецгода(ОбщийМодульКлиент.ПользователяТекущаяДата());
	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура Вчера(Команда)

	отчет.ДатаНачала = НачалоДня(НачалоДня(ОбщийМодульСервисСервер.ПользователяТекущаяДата()) - 100);
	отчет.ДатаОкончания = КонецДня(отчет.ДатаНачала);
	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)

	отчет.ПериодОтчета.ДатаНачала = отчет.ДатаНачала;

	Если отчет.ДатаНачала > Отчет.ДатаОкончания Тогда
		Отчет.ДатаОкончания = отчет.ДатаНачала;
		отчет.ПериодОтчета.ДатаОкончания = Отчет.ДатаОкончания;
	КонецЕсли;

	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)

	отчет.ПериодОтчета.ДатаОкончания = отчет.ДатаОкончания;

	Если отчет.ДатаНачала > Отчет.ДатаОкончания Тогда
		отчет.ДатаНачала = Отчет.ДатаОкончания;
		отчет.ПериодОтчета.ДатаНачала = Отчет.ДатаНачала;
	КонецЕсли;

	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура ДетализироватьПриИзменении(Элемент)
	ДетализироватьПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДетализироватьПриИзмененииНаСервере()
	Константы.ДетализироватьИнформацияРуководителю.Установить(Детализировать);
КонецПроцедуры

&НаКлиенте
Процедура МинусДень(Команда)

	отчет.ДатаНачала = отчет.ДатаНачала - 3600 * 24;
	отчет.ДатаОкончания = отчет.ДатаОкончания - 3600 * 24;
	отчет.ПериодОтчета.ДатаНачала = отчет.ДатаНачала;
	отчет.ПериодОтчета.ДатаОкончания = отчет.ДатаОкончания;
	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНаправлениюДеятельностиПриИзменении(Элемент)

	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСкладуПриИзменении(Элемент)

	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРуководителю(Команда)

	Результат = Новый ТабличныйДокумент;
	Результат.КлючПараметровПечати = "Отчет_Руководителю";
	Результат.КлючПараметровПечати = Результат.ИмяПараметровПечати;
	ОбщийМодульСервер.ПечатьНаСервереОтчетаРуководителю(СтруктураДанныхОтчета(), Результат);
	ОбщийМодульКлиент.ОтправитьПоEMAIL(Результат, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчет Руководителю"));

КонецПроцедуры

&НаСервере
Процедура ОформитьОтчет(Знач СтруктураОтчета)

	Реквизиты = метаданные.Отчеты.ИнформацияРуководителю.Реквизиты;

	Для Каждого Реквизит Из Реквизиты Цикл
		Попытка
			Отчет[Реквизит.имя] = СтруктураОтчета[Реквизит.имя];
		Исключение
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)

	Отчет.ДатаНачала = Отчет.ПериодОтчета.ДатаНачала;
	Отчет.ДатаОкончания = Отчет.ПериодОтчета.ДатаОкончания;
	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечати");
	ОбщийМодульСервер.ПечатьНаСервереОтчетаРуководителю(СтруктураДанныхОтчета(), ФормаПечати.Результат);

	ФормаПечати.Результат.ОтображатьСетку 	= ЛОЖЬ;
	ФормаПечати.Результат.Защита 			= ИСТИНА;
	ФормаПечати.Результат.ТолькоПросмотр 	= ИСТИНА;
	ФормаПечати.Результат.ОтображатьЗаголовки = ЛОЖЬ;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Отчет руководителю");
	ФормаПечати.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ПлюсДень(Команда)

	отчет.ДатаНачала = отчет.ДатаНачала + 3600 * 24;
	отчет.ДатаОкончания = отчет.ДатаОкончания + 3600 * 24;
	отчет.ПериодОтчета.ДатаНачала = отчет.ДатаНачала;
	отчет.ПериодОтчета.ДатаОкончания = отчет.ДатаОкончания;
	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                 // ПРИ ЗАКРЫТИИ

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                            // ПРИ ОТКРЫТИИ

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	Элементы.Взаиморасчеты.Видимость = УчетПоКлиентам;
	Если НЕ ЗначениеЗаполнено(Отчет.ДатаНачала) Тогда
		Отчет.ДатаНачала 	= началоГода(ОбщийМодульКлиент.ПользователяТекущаяДата());
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда
		Отчет.ДатаОкончания = ОбщийМодульКлиент.ПользователяТекущаяДата();
	КонецЕсли;

	Отчет.ПериодОтчета.ДатаНачала 		= Отчет.ДатаНачала;
	Отчет.ПериодОтчета.ДатаОкончания 	= Отчет.ДатаОкончания;
	Отчет.ПериодОтчета.ДатаНачала 		= Отчет.ДатаНачала;
	отчет.ПериодОтчета.ДатаОкончания 	= Отчет.ДатаОкончания;

	Если НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда
		СформироватьИнформацияРуководителю();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002600", ЭтаФорма, Отказ, );

	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);
		КонецЕсли;

		УчетПоКлиентам = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам");
		Элементы.ВзаимоРасчетыСПоставщиками.Видимость 	= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам");
		Элементы.Деньги.Видимость 						= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег");
		Элементы.КромеДолговПоТоварам.Видимость 		= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников");
		Элементы.ОтправитьРуководителю.Видимость 		= НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЭлектроннаяПочтаПользователь", ИСТИНА) = "";
		Элементы.ОбщаяВаловаяПрибыль.Видимость 			= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетВаловойПрибыли");
		Детализировать 									= Константы.ДетализироватьИнформацияРуководителю.Получить();
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.КупленоКоличество, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ПроданоКоличество, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.СреднееКоличествоРеализации, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.СписаноКоличество, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ОстаткиТоваровКоличество, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ПоступилоКоличество, , ИСТИНА);
	КонецЕсли;

	ОбщийМодульСервисСервер.ОбработатьНовуюФорму(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы) Экспорт // Для реакции на события для запрограммированных элементов
	ОбщийМодульКлиент.РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)

	отчет.датаначала = ОбщийМодульКлиент.ПользователяТекущаяДата();
	отчет.датаокончания = ОбщийМодульКлиент.ПользователяТекущаяДата();
	СформироватьИнформацияРуководителю();

КонецПроцедуры

&НаСервере
Функция   СтруктураДанныхОтчета()

	РезультатСтруктураДанныхОтчета = Новый Структура;
	Реквизиты = метаданные.Отчеты.ИнформацияРуководителю.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		РезультатСтруктураДанныхОтчета.Вставить(Реквизит.Имя, Отчет[Реквизит.Имя]);

	КонецЦикла;

	Возврат РезультатСтруктураДанныхОтчета;

КонецФункции // СтруктураДанныхОтчета

&НаКлиенте
Функция   СтруктураУсловий()

	РезультатСтруктураУсловий = Новый Структура;
	РезультатСтруктураУсловий.Вставить("ДатаНачала", отчет.ДатаНачала);
	РезультатСтруктураУсловий.Вставить("ДатаОкончания", Отчет.ДатаОкончания);
	РезультатСтруктураУсловий.Вставить("ОтборПоСкладу", Отчет.ОтборПоСкладу);
	РезультатСтруктураУсловий.Вставить("ОтборПоНаправлениюДеятельности", Отчет.ОтборПоНаправлениюДеятельности);

	Возврат РезультатСтруктураУсловий;

КонецФункции // СтруктураУсловий()

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьИнформацияРуководителю(ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИнформацияРуководителю(Знач ПоКнопкеНаФорме = ЛОЖЬ)

	Если ПоКнопкеНаФорме
		ИЛИ НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда

		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Формируется отчет.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		СтруктураОтчета = ОбщийМодульСервер.СформироватьИнформацияРуководителюНаСервере(СтруктураУсловий());
		Если НЕ СтруктураОтчета = Неопределено Тогда
			ОформитьОтчет(СтруктураОтчета);
		КонецЕсли;

		ОбновитьИнтерфейс();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭтотМесяц(Команда)

	отчет.ДатаНачала = началомесяца(ОбщийМодульКлиент.ПользователяТекущаяДата());
	отчет.ДатаОкончания = конецмесяца(ОбщийМодульКлиент.ПользователяТекущаяДата());
	СформироватьИнформацияРуководителю();

КонецПроцедуры
